cask_args appdir: "/Applications"

tap "cjbassi/gotop"
tap "clementtsang/bottom"
tap "heroku/brew"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"

# Unix
brew "ansifilter" # filter out escape codes from tmux capture
brew "cmake"
brew "direnv"
brew "openssl"
brew "p7zip"
brew "rcm"
brew "reattach-to-user-namespace"
brew "rename"

# ZSH
brew "antibody"
brew "fzf"
brew "pv"
brew "z"
brew "zsh"

# Better Unix
brew "bat" # cat
brew "bottom" # top
brew "exa" # ls
brew "fd" # find
brew "prettyping" # ping
brew "ripgrep" # grep
brew "tldr" # man pages

# Git
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "gh"
brew "lazygit"

# Programming
brew "asdf"
brew "cloc"
brew "efm-langserver"
brew "httpie"
brew "jq"
brew "neovim", args: ["HEAD"]
brew "overmind"
brew "tmux"
brew "universal-ctags", args: ["HEAD"]

# Heroku
brew "heroku-node" # heroku and parity dependency
brew "heroku"
brew "parity"

# Image manipulation
brew "imagemagick"
brew "guetzli"

# C++
brew "ccls"
brew "clang-format"
brew "cppcheck"
brew "llvm"

# Python
brew "pipx"
brew "poetry"

# Shell
brew "shellcheck"
brew "shfmt"

# Applications
cask "1password-beta"
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "dash"
cask "fantastical"
cask "firefox-developer-edition"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "hammerspoon"
cask "handbrake"
cask "imagealpha"
cask "imageoptim"
cask "keepingyouawake"
# cask "kitty"
cask "ngrok"
cask "paw"
cask "postgres"
cask "postico"
cask "qbserve"
cask "rectangle"
# cask "screenflow"
cask "slack"
cask "spotify"
cask "vlc"
cask "zoom"

brew "mas"
mas "Ka-Block!", id: 1335413823
mas "Next Meeting", id: 1017470484
mas "Todoist", id: 585829637
