cask_args appdir: "/Applications"

tap "clementtsang/bottom"
tap "heroku/brew"
tap "thoughtbot/formulae"

# Unix
brew "ansifilter" # filter out escape codes from tmux capture
brew "blueutil" # control bluetooth devices
brew "cmake"
brew "coreutils" # gdircolors
brew "direnv"
brew "gnu-sed"
brew "openssl"
brew "p7zip"
brew "rcm"
brew "reattach-to-user-namespace"
brew "rename"
brew "sleepwatcher"
brew "watchman"

# ZSH
brew "antidote"
brew "fzf"
brew "pv"
brew "zoxide" # smarter cd (z command)
brew "zsh"

# Better Unix
brew "bat" # cat
brew "bottom" # top
brew "eza" # ls
brew "fd" # find
brew "prettyping" # ping
brew "ripgrep" # grep
brew "tldr" # man pages

# Git
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "gh"
brew "lazygit"

# Programming
brew "cloc"
brew "httpie"
brew "jq"
brew "mise"
brew "neovim"
brew "overmind"
brew "tmux"
brew "universal-ctags"
brew "vale"

# Image manipulation
brew "imagemagick"
brew "guetzli"

# C++
brew "cppcheck"
brew "llvm"

# Python
brew "pipx"
brew "poetry"

# Applications
cask "1password"
cask "appcleaner"
cask "claude"
cask "claude-code"
cask "docker"
cask "fantastical"
cask "firefox@developer-edition"
cask "google-chrome"
cask "hammerspoon"
cask "handbrake"
cask "imagealpha"
cask "imageoptim"
cask "keepingyouawake"
cask "kitty"
cask "linear-linear"
cask "mimestream"
cask "ngrok"
cask "postico"
cask "qbserve"
cask "raycast"
cask "rectangle"
cask "slack"
cask "spotify"
cask "vlc"
cask "zoom"
