# antibody bundle < ~/.zsh_plugins.txt > ~/.zsh_plugins.sh

# Oh My Zsh!
ohmyzsh/ohmyzsh path:plugins/bundler

# Plugins
azu/ni.zsh # one command for all node package managers
MichaelAquilina/zsh-autoswitch-virtualenv
zsh-users/zsh-autosuggestions
zsh-users/zsh-completions
zsh-users/zsh-syntax-highlighting

# Pure Theme
mafredri/zsh-async
sindresorhus/pure branch:main
